      *----------------------------------------------------------------*
      *    COPYBOOK CPF-CNPJ - LAYOUT                                   
      *----------------------------------------------------------------*
      *
       01  REG-::.
           03  FILLER                  PIC S9(004) COMP.
           03  SPT::                   PIC  X(008).
           03  NUMERO-::               PIC  9(015).
           03  TIPO-CALCULO-::         PIC  X(004).
           03  RETORNO-::              PIC  9(001).