      *----------------------------------------------------------------*
      *    COPYBOOK CLIENTES - LAYOUT DO ARQUIVO CLIENTES
      *----------------------------------------------------------------*
      *
       01  REG::.
           03  CODIGO::                PIC  9(007).          
           03  CNPJ::                  PIC  9(014).
           03  RSOCIAL::               PIC  X(040).
           03  LATITUDE::              PIC S9(003)V9(008).
           03  LONGITUDE::             PIC S9(003)V9(008).