      *----------------------------------------------------------------*
      *    COPYBOOK DISTRIB - LAYOUT ARQUIVO DISTRIBUICAO
      *----------------------------------------------------------------*
      *
       01  REG::.
           03  CCLIENTE::              PIC  9(007).
           03  RSOCIAL::               PIC  X(040).
           03  CVENDEDOR::             PIC  9(003).
           03  NOME::                  PIC  X(040).
           03  DISTANCIA::             PIC  9(009).