      *----------------------------------------------------------------*
      *    COPYBOOK VENDEDORES - LAYOUT                                 
      *----------------------------------------------------------------*
      *
       01  REG::.
           03  CODIGO::                PIC  9(003).
           03  CPF::                   PIC  9(011).
           03  NOME::                  PIC  X(040).
           03  LATITUDE::              PIC S9(003)V9(008).
           03  LONGITUDE::             PIC S9(003)V9(008).