      *----------------------------------------------------------------*
      *    COPYBOOK SUBPROGRAMAS - LAYOUT                                 
      *----------------------------------------------------------------*
      *
       01  ::-PARM.
           03  FILLER                  PIC S9(004) COMP.
           03  ::-PARAM            	   PIC  X(001).
           03  ::-RETORNO          	   PIC  X(002).
           03  ::-MENSAGEM             PIC  X(068).